# <span style="color:#4CCFA2">Lab - Intro to Pandas - Alumni Dataset Analysis</span> üêº

### Instructions

This assignment will be done completely inside this Jupyter notebook with answers placed in the cell provided.

Follow all the instructions in this notebook to complete these tasks.

In [1]:
# Imports
import pandas as pd

### Question 1 :  Import CSV file


Write code to load the alumni csv dataset into a Pandas DataFrame called `df`.

In [2]:
df = pd.read_csv('data/alumni.csv')

### Question 2 :  Understand the Data

Use the following pandas commands to understand the data set: a) head, b) tail, c) dtypes, d) info, e) describe

In [3]:
#a) head
df.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

In [4]:
#b) tail
df.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [5]:
#c) dtypes - Notice anything wrong? Any column that should be a different dtype?
# We'll take care of it on a future step!

In [6]:
#d) info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

In [7]:
#e) describe
df.describe()

       Year Graduated         Salary           Fee
count       88.000000      88.000000     88.000000
mean      2006.477273   84090.909091  11708.727273
std          1.560852   21234.128008   1110.647949
min       2004.000000   35000.000000  10869.000000
25%       2005.000000   75000.000000  10968.000000
50%       2006.500000   75000.000000  11696.000000
75%       2008.000000   90000.000000  12058.250000
max       2009.000000  160000.000000  20960.000000

### Question 3 :  Cleaning the Data - Part A

In [8]:
def clean_currency(curr):
    return float(curr.replace(",", "").replace("$", ""))

# Proving the function works!
clean_currency("$66,000")

66000.0

a) Use clean_currency function above to strip out commas and dollar signs from Savings ($) column and put into a new column called `Savings`.

In [9]:
# a) 
df['Savings'] = df['Savings ($)'].apply(clean_currency)

b) Check your dtypes again to confirm `Salary` is a float!

In [10]:
# b)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
 8   Savings         88 non-null     float64
dtypes: float64(1), int64(3), object(5)
memory usage: 6.3+ KB

### Question 4 :  Cleaning the Data - Part B

a) Run `df['Gender'].value_counts()` to see the incorrect `M` fields that need to be converted to `Male`

In [11]:
# a)
df['Gender'].value_counts()

Gender
Male      46
Female    39
M          3
Name: count, dtype: int64

b) Now use the replace method to replace all `M` with `Male`. Don't forget to make this change permanent by overriding the column!

In [12]:
# b)
df['Gender'] = df['Gender'].replace('M','Male')

In [13]:
df['Gender'].value_counts()

Gender
Male      49
Female    39
Name: count, dtype: int64

### Question 5 :  Working with the Data

a) Get the median, b) mean and c) standard deviation for the `Salary` column

In [14]:
# a)
df['Salary'].median()

75000.0

In [15]:
# b)
df['Salary'].mean()

84090.90909090909

In [16]:
# c)
df['Salary'].std()

21234.1280081736

d) Identify which alumni paid more than $15000 in fees, using the `Fee` column

In [17]:
# d)
df[df['Fee'] > 15000]

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
18,2006,Male,Married,Standard Diploma,No,140000,20960,"$72,000",72000.0

### Question 6 : Mixed Review!

In [18]:
# a) Can you display the unique values in the 'marital status' column?

df['Marital Status'].unique()

array(['Single', 'Married', 'Divorced'], dtype=object)

In [19]:
# b) Can you create a subset of the data containing only married alumni?

df_married = df[df['Marital Status'] == 'Married']
df_married.head(10)

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000",116000.0
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000",76000.0
5,2007,Female,Married,College Prep Diploma,No,60000,11948,"$67,000",67000.0
8,2007,Male,Married,Standard Diploma,No,75000,11724,"$86,000",86000.0
11,2007,Female,Married,Standard Diploma,No,40000,12717,"$52,000",52000.0
13,2007,Male,Married,College Prep Diploma,Yes,85000,12055,"$32,000",32000.0
15,2009,Male,Married,College Prep Diploma,Yes,90000,12055,"$40,000",40000.0
18,2006,Male,Married,Standard Diploma,No,140000,20960,"$72,000",72000.0
21,2004,Male,Married,Standard Diploma,Yes,90000,11691,"$67,000",67000.0
23,2006,Male,Married,College Prep Diploma,No,75000,11691,"$82,000",82000.0

In [20]:
# c) How do you sort the dataset based on the 'salary' column in descending order?

df.sort_values(by=['Salary'],ascending=False)

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
6,2006,Male,Divorced,Standard Diploma,No,160000,11724,"$120,000",120000.0
43,2008,Male,Married,College Prep Diploma,No,160000,11693,"$62,000",62000.0
18,2006,Male,Married,Standard Diploma,No,140000,20960,"$72,000",72000.0
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000",86000.0
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000",76000.0
...,...,...,...,...,...,...,...,...,...
5,2007,Female,Married,College Prep Diploma,No,60000,11948,"$67,000",67000.0
17,2005,Female,Single,Standard Diploma,Yes,60000,10960,"$36,000",36000.0
30,2005,Male,Single,Standard Diploma,No,60000,10962,"$57,000",57000.0
11,2007,Female,Married,Standard Diploma,No,40000,12717,"$52,000",52000.0
22,2005,Female,Single,Standard Diploma,Yes,35000,11691,"$40,000",40000.0

In [21]:
# d) What are the different types of diplomas?

df['Diploma Type'].unique()

array(['Standard Diploma', 'College Prep Diploma'], dtype=object)

In [22]:
# e) Filter the dataset to those who graduated before the year 2006, who are single, and have $50,000 or more in savings

df_filtered = df[(df['Year Graduated'] < 2006) & (df['Marital Status'] == 'Single') & (df['Savings'] >= 50000)]
df_filtered

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000",86000.0
29,2004,Male,Single,Standard Diploma,Yes,110000,10962,"$52,000",52000.0
30,2005,Male,Single,Standard Diploma,No,60000,10962,"$57,000",57000.0
76,2005,Male,Single,Standard Diploma,No,90000,11335,"$52,000",52000.0

In [23]:
# f) BONUS (Optional): 
# Can you rename the column names to lowercased letters and underscores for spaces?
df.columns = df.columns.str.lower().str.replace(' ', '_')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year_graduated  88 non-null     int64
 1   gender          88 non-null     object
 2   marital_status  88 non-null     object
 3   diploma_type    88 non-null     object
 4   defaulted       88 non-null     object
 5   salary          88 non-null     int64
 6   fee             88 non-null     int64
 7   savings_($)     88 non-null     object
 8   savings         88 non-null     float64
dtypes: float64(1), int64(3), object(5)
memory usage: 6.3+ KB